################################################################
# Creating clock
################################################################
create_clock -name clk -period 20.000 [get_ports {clk}]
################################################################
# Deriving clock uncertainity
################################################################
derive_clock_uncertainty
################################################################
# Setting False path to LEDs
################################################################
set_false_path -to [get_ports {LED[7] LED[0] LED[1] LED[2] LED[3] LED[4] LED[5] LED[6]}]
################################################################
# Giving an input delay to reset_n
################################################################
set_input_delay -clock { clk } 2 [get_ports {reset_n}]
